Revit 2027 API
Concrete.ConcreteFinish Property
 The property labeled "Type" from the "Concrete" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string ConcreteFinish { get; }
Public Shared ReadOnly Property ConcreteFinish As String
	Get
public:
static property String^ ConcreteFinish {
	String^ get ();
}
static member ConcreteFinish : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "ConcreteFinishType".
See Also
Reference
Concrete Class
Autodesk.Revit.DB.Visual Namespace